Repository: BravoBaldo/Translations
Catalog: FastLed/FastLED_OmegaT/tm/auto/SSI-SE955-Omegat-level2.tmx
Source language: en_us
Languages: it_it

source: Two algorithms are provided, a manual and an automatic mode.
it_it: Sono disponibili due algoritmi, uno manuale e uno automatico.

source: Two mechanical coupled stepper motors (Figure 2.5) need to be fixed on a base plate.
it_it: Due motori passo-passo accoppiati meccanicamente (Figura 2.5) devono essere fissati su una piastra di base.

source: Two setting are available for ½ current and for ¼ current when the load below the programmed limit is detected.
it_it: Sono disponibili due impostazioni per ½ corrente e per ¼ di corrente quando viene rilevato un carico al di sotto del limite programmato.

source: Type
it_it: Tipo

source: Typically, StallGuard2 works best with an SGT value within the range of -10… +10.
it_it: In genere, StallGuard2 funziona meglio con un valore SGT compreso tra -10 … +10.

source: Typically, there are more valid SGT values than one which satisfy the requirement SG = 0 at maximum load.
it_it: In genere, ci sono più valori di SGT validi di uno che soddisfa il requisito SG = 0 al carico massimo.

source: Under no load condition, the cool step will regulate current to half of its value, which is 0.25 amps, which corresponds to internal unit of 5.5 approximately.
it_it: In assenza di carico, il cool step regolerà la corrente a metà del suo valore, ovvero 0,25 ampere, che corrisponde a circa 5,5 unità interne.

source: Under normal load conditions, the load angle is low and part of energy flowing into the motor also flows back to the power supply resulting in back EMS.
it_it: In condizioni di carico normali, l'angolo di carico è basso e parte dell'energia che fluisce nel motore ritorna anche all'alimentatore, dando origine al cosiddetto back EMS (ritorno statico di energia).

source: Unsolicited ACK/NAK
it_it: ACK/NAK non richiesti

source: Unused bits must be set to 0.
it_it: I bit non utilizzati devono essere impostati a 0.

source: Upon detecting the active HOST CTS, the host transmits the message on the HOST TXD line, verifying that HOST CTS remains active on a character-by-character basis.
it_it: Dopo aver rilevato l'HOST CTS attivo, l'host trasmette il messaggio sulla linea HOST TXD, verificando che l'HOST CTS rimanga attivo carattere per carattere.

source: Upper velocity threshold value for CoolStep and stop on stall.
it_it: Valore di soglia di velocità superiore per CoolStep e arresto in stallo.

source: Using both edges cuts the toggle rate of the STEP signal in half, which is useful for communication over slow interfaces such as optically isolated interfaces.
it_it: L'utilizzo di entrambi i fronti dimezza la velocità di commutazione del segnale STEP, il che è utile per la comunicazione su interfacce lente come quelle otticamente isolate.

source: Usually, this SPI timing is referred to as SPI MODE 3
it_it: Solitamente, questa temporizzazione SPI è definita SPI MODE 3

source: VCC is not monitored.
it_it: VCC non è monitorato.

source: Valid for TMC260, TMC261, TMC262, TMC2041, TMC2130, TMC2209, TMC2226, TMC2300, TMC2660, TMC5031, TMC5041, TMC5062, TMC5072, TMC5130, and TMC5160
it_it: Valido per TMC260, TMC261, TMC262, TMC2041, TMC2130, TMC2209, TMC2226, TMC2300, TMC2660, TMC5031, TMC5041, TMC5062, TMC5072, TMC5130 e TMC5160

source: Variable number of bytes
it_it: Numero variabile di byte

source: Variation of StallGuard2 Values SG with Selected Current
it_it: Variazione dei Valori SG di StallGuard2 con la Corrente Selezionata

source: Variation of StallGuard2 Values SG with Speed
it_it: Variazione del valore di StallGuard2 SG in base alla velocità

source: Variation of StallGuard2 Values SG with Supply Voltage
it_it: Variazione dei valori di StallGuard2 SG con la tensione di alimentazione

source: Variation of StallGuard4 values
it_it: Variazione dei valori di StallGuard4

source: Various transaction examples are shown in Figure A-1 through Figure A-8.
it_it: Diversi esempi di transazioni sono mostrati nelle Figure A-1 fino alla Figure A-8.

source: Version
it_it: Versione

source: Wakes up decoder after it's been powered down.
it_it: Riattiva [sveglia] il decoder dopo lo spegnimento.

source: We also need some acceleration and for this we set the midpoint value of the acceleration knob and press enter.
it_it: Abbiamo anche bisogno di un po' di accelerazione e per questo impostiamo il valore medio della manopola di accelerazione e premiamo Invio.

source: We call it StallGuard, because the main use case is to safely detect a stall of the motor in order to replace a mechanical stop switch.
it_it: Lo chiamiamo StallGuard perché il suo utilizzo principale è il rilevamento sicuro di uno stallo del motore per sostituire un fine-corsa meccanico.

source: We can see that current in the current setting, which right now corresponds to 12 internal units and 0.55 ampere RMS.
it_it: Possiamo vedere questa corrente nell'impostazione corrente, che al momento corrisponde a 12 unità interne e 0,55 ampere RMS.

source: We have two options here, half of CS and quarter of CS.
it_it: Abbiamo due opzioni: metà di CS e un quarto di CS.

source: We now see two graphs.
it_it: Ora vediamo due grafici.

source: We now set the smart energy stall velocity to 0 to disable the stall guard before we configure and demonstrate the cool step.
it_it: Impostiamo la velocità di stallo Smart Energy a 0 per disattivare la protezione dallo stallo prima di configurare e dimostrare la fase di raffreddamento.

source: We recommend this handshaking remain enabled to provide feedback to the host.
it_it: Si consiglia di mantenere abilitato questo handshake per fornire un feedback all'host.

source: We set it to half of its value.
it_it: Impostiamo il valore a metà.

source: We set the spot energy stall velocity to a lower value than this value.
it_it: Impostiamo la velocità di stallo dell'energia spot a un valore inferiore a questo valore.

source: We will increase it slowly one step at a time and press enter after every increment.
it_it: La aumenteremo lentamente, un passo alla volta, e premeremo Invio dopo ogni incremento.

source: What is StallGuard?
it_it: Cos'è StallGuard?

source: When TSTEP < TCOOLTHRS , StallGuard4 have the ability to activate.
it_it: Quando TSTEP < TCOOLTHRS , StallGuard4 può attivarsi.

source: When CSN goes high, the contents of the internal shift register are latched into the internal control register and recognized as a command from the master to the node.
it_it: Quando il CSN diventa alto, il contenuto del registro a scorrimento interno viene agganciato al registro di controllo interno e riconosciuto come un comando dal master al nodo.

source: When CTS is made active by the host, the decoder responds by making the RTS line active, even if the decoder was attempting to transmit, deferring to host action.
it_it: Quando il CTS viene attivato dall'host, il decoder risponde attivando la linea RTS, anche se stava tentando di trasmettere, rimandando l'azione all'host.

source: When SSI hosts establish communication, they typically set this option to 0 (disable), which disables parameter scanning.
it_it: Quando gli host SSI stabiliscono la comunicazione, in genere impostano questa opzione su 0 (disabilita), disabilitando la scansione dei parametri.

source: When StallGuard2 is proper parameterized you can proceed with the parameterization of CoolStep.
it_it: Una volta parametrizzata correttamente StallGuard2, è possibile procedere con la parametrizzazione di CoolStep.

source: When a motor has been designed to give the application torque with 80% current, its resistive losses reduce to 64% while 80% of the torque is available.
it_it: Quando un motore è stato progettato per fornire la coppia richiesta con l'80% di corrente, le sue perdite resistive si riducono al 64%, mentre è disponibile l'80% della coppia.

source: When all characters are received (length of message plus the two byte checksum) the decoder acts upon the message/command and ignores further characters.
it_it: Quando tutti i caratteri vengono ricevuti (lunghezza del messaggio più checksum di due byte), il decoder agisce sul messaggio/comando e ignora gli altri caratteri.

source: When contacting support, please have the following information available:
it_it: Quando si contatta l'assistenza, tenere a portata di mano le seguenti informazioni:

source: When disabled, data is transmitted as raw ASCII data.
it_it: Se disabilitato, i dati vengono trasmessi come dati ASCII grezzi.

source: When the decoder detects that CTS is inactive, it makes RTS inactive and transmits the response.
it_it: Quando il decoder rileva che il CTS è inattivo, rende inattivo l'RTS e trasmette la risposta.

source: When the decoder receives this command, it beeps the sequence provided in the BEEP directive.
it_it: Quando il decoder riceve questo comando, emette la sequenza di segnali acustici specificata nella direttiva BEEP.

source: When the host wants to transmit data to the decoder:
it_it: Quando l'host desidera trasmettere dati al decoder:

source: When the load decreases, SG_RESULT rises above (SEMIN + SEMAX + 1) * 32, and the current is reduced.
it_it: Quando il carico diminuisce, SG_RESULT sale sopra (SEMIN + SEMAX + 1) * 32 e la corrente viene ridotta.

source: When the load increases, SG_RESULT falls below SEMIN, and CoolStep increases the current.
it_it: Quando il carico aumenta, SG_RESULT scende al di sotto di SEMIN e CoolStep aumenta la corrente.

source: When the velocity of the motor exceeds the smartEnergy stall velocity, the motor will now stop if the SG value reaches 0.
it_it: Quando la velocità del motore supera la velocità di stallo smartEnergy, il motore si arresta se il valore SG raggiunge 0.

source: When this parameter is enabled, the data is sent in a DECODE_DATA packet.
it_it: Quando questo parametro è abilitato, i dati vengono inviati in un pacchetto DECODE_DATA.

source: When this pin goes high, stop sending steps to the driver.
it_it: Quando questo pin va alto, interrompere l'invio di passi al driver.

source: When using the TMCL-IDE another parameter, smartEnergy stall velocity also needs to be set.
it_it: Quando si utilizza TMCL-IDE, è necessario impostare anche un altro parametro, la velocità di stallo smartEnergy.

source: When using the TMCL-IDE, another parameter, smartEnergy stall velocity also needs to be set.
it_it: Quando si utilizza TMCL-IDE, è necessario impostare anche un altro parametro, la velocità di stallo di smartEnergy.

source: When using the open drain output, an external pull up resistor in the range 4.7kΩ to 33kΩ is required.
it_it: Quando si utilizza l'uscita open drain, è necessario un resistore pull up esterno compreso tra 4,7 kΩ e 33 kΩ.

source: When working without interpolation at less than 256 microsteps, the index time goes down to two CLK clock cycles.
it_it: Quando si lavora senza interpolazione a meno di 256 micropassi, il tempo dell'indice scende a due cicli di clock CLK.

source: When you see SG_RESULT increasing at higher velocities, there will be useful stall detection.
it_it: Quando si vede SG_RESULT aumentare a velocità più elevate, si otterrà un utile rilevamento dello stallo.

source: Whenever ENCA_DCIN becomes pulled high, the motor will stop abruptly and go to the power down state, as configured via IHOLD, IHOLD_DELAY and StealthChop standstill options.
it_it: Ogni volta che ENCA_DCIN diventa alto, il motore si fermerà improvvisamente e passerà allo stato di spegnimento, come configurato tramite le opzioni di arresto IHOLD, IHOLD_DELAY e StealthChop.

source: Whenever data is read from or written to the TMC5130A, the MSBs delivered back contain the SPI status, SPI_STATUS, a number of eight selected status bits.
it_it: Ogni volta che i dati vengono letti o scritti sul TMC5130A, i bit più significativi restituiti contengono lo stato SPI, SPI_STATUS, un numero di otto bit di stato selezionati.

source: While monitoring the StallGuard2 value via the TMCL-IDE, you may actually miss the last StallGuard2 value which precedes the stall, especially when working at higher velocities.
it_it: Monitorando il valore di StallGuard2 tramite TMCL-IDE, si potrebbe effettivamente perdere l'ultimo valore di StallGuard2 che precede lo stallo, soprattutto quando si lavora a velocità elevate.

source: While monitoring the StallGuard4 value via the evaluation board tool, you may miss the last StallGuard4 value which precedes the stall, especially when working at higher velocities.
it_it: Monitorando il valore StallGuard4 tramite lo strumento della evaluation board, è possibile che non venga rilevato l'ultimo valore StallGuard4 che precede lo stallo, soprattutto quando si lavora a velocità elevate.

source: While the energy-based principle is very deterministic, parasitic effects like resistive losses within the motor and motor construction dependence give a major contribution to the quality of the measurement result.
it_it: Sebbene il principio basato sull'energia sia fortemente deterministico, effetti parassiti come le perdite resistive all'interno del motore e la dipendenza dalla struttura del motore stesso contribuiscono in modo significativo alla qualità del risultato della misurazione.

source: While the host is not required to continuously stream characters, the maximum character-to-character delay cannot exceed the host Intercharacter Timeout parameter.
it_it: Sebbene l'host non sia tenuto a trasmettere caratteri in streaming continuo, il ritardo massimo tra caratteri non può superare il parametro di timeout tra caratteri dell'host.

source: While the host should try to avoid interrupting the decoder transmission, bus collisions are possible and must defer to the host.
it_it: Sebbene l'host debba cercare di evitare di interrompere la trasmissione del decoder, sono possibili collisioni tra bus che devono essere gestite dall'host.

source: While the motor torque is proportional to the motor current, resistive losses rise with the square of the current.
it_it: Mentre la coppia del motore è proporzionale alla corrente del motore, le perdite resistive aumentano con il quadrato della corrente.

source: With 25% power dissipation you get a 75% power saving.
it_it: Con una dissipazione di potenza del 25% si ottiene un risparmio energetico del 75%.

source: With DcStep the nominal application load can be extended to a higher torque only limited by the safety margin near the holding torque area (which is the highest torque the motor can provide).
it_it: Con DcStep il carico nominale dell'applicazione può essere esteso a una coppia superiore limitata solo dal margine di sicurezza vicino all'area della coppia di mantenimento (che è la coppia più alta che il motore può fornire).

source: With SEIMIN=O the CoolStep function is disabled.
it_it: Con SEIMIN=O la funzione CoolStep è disabilitata.

source: With SEMIN = 0 CoolStep is switched off.
it_it: Con SEMIN = 0, CoolStep è disattivato.

source: With StealthChop, the motor current is applied by driving a certain effective voltage into the coil, using a voltage mode PWM. There are no more configurations required except for the PWM voltage regulator response to a change of motor current.
it_it: Con StealthChop, la corrente del motore viene applicata inducendo una certa tensione effettiva nella bobina, utilizzando un PWM in modalità tensione. Non sono richieste altre configurazioni, ad eccezione della risposta del regolatore di tensione PWM a una variazione di corrente del motore.

source: With a good choice of the StallGuard2 threshold parameter SGT, one gets a plot like Figure 2.8 with StallGuard2 values SG in a range of some hundred and a clear zero for maximum load.
it_it: Con una buona scelta del parametro di soglia SGT di StallGuard2, si ottiene un grafico come quello della Figura 2.8 con valori SG di StallGuard2 compresi in un intervallo di alcune centinaia e un chiaro zero per il carico massimo.

source: With a high SGT, SG_RESULT will rise up to the maximum value.
it_it: Con un SGT elevato, SG_RESULT salirà fino al valore massimo.

source: With a sufficient SGT value, one gets StallGuard2 values in a range of SG_MAX to SG_MIN=0 where SG_MAX represents NO LOAD and SG_MIN=0 represents the MAXIMUM LOAD resp. stall .
it_it: Con un valore di SGT sufficiente, si ottengono valori di StallGuard2 compresi tra SG_MAX e SG_MIN=0, dove SG_MAX rappresenta NO LOAD e SG_MIN=0 rappresenta il MAXIMUM LOAD e lo stallo .

source: With load close to stall:
it_it: Con carico prossimo allo stallo:

source: With mechanical load close to stall, one gets StallGuard2 values SG of zero.
it_it: Con un carico meccanico prossimo allo stallo, si ottengono valori di StallGuard2 SG pari a zero.

source: With that, one can hold the motor by hand and observe the StallGuard2 signal if it comes to zero if the motor is close to stall or stalls.
it_it: In questo modo, è possibile tenere il motore con le mani e osservare il segnale StallGuard2 se arriva a zero, se il motore è vicino allo stallo o si blocca.

source: With that, one gets a characteristic StallGuard2 value named SG that represents the mechanical load angle resp. the reserve in load angle to stall.
it_it: Con questo, si ottiene un valore caratteristico di StallGuard2 denominato SG che rappresenta l'angolo di carico meccanico e la riserva di angolo di carico per lo stallo.

source: With this feature, the motor will never stall.
it_it: Con questa funzione, il motore non andrà mai in stallo.

source: Without mechanical load:
it_it: Senza carico meccanico:

source: Works with the SpreadCycle current control algorithm.
it_it: Funziona con l'algoritmo di controllo della corrente SpreadCycle.

source: Works with the StealthChop voltage control algorithm.
it_it: Funziona con l'algoritmo di controllo della tensione StealthChop.

source: Write only
it_it: Solo scrittura

source: You can also see it here in the graph.
it_it: Potete vederla anche qui nel grafico.

source: Zebra is not responsible for any damages incurred during shipment if the approved shipping container is not used.
it_it: Zebra non è responsabile per eventuali danni subiti durante la spedizione se non viene utilizzato il contenitore di spedizione approvato.

source: Zebra responds to calls by e-mail, telephone or fax within the time limits set forth in service agreements.
it_it: Zebra risponde alle chiamate via e-mail, telefono o fax entro i limiti di tempo stabiliti nei contratti di assistenza.

source: Zero is the starting value working with most motors.
it_it: Zero è il valore iniziale che funziona con la maggior parte dei motori.

source: action
it_it: azione

source: data sent to TMC5130A data received from TMC5130A
it_it: Dati inviati al TMC5130A Dati ricevuti dal TMC5130A

source: disable CoolStep
it_it: disattiva CoolStep

source: en
it_it: It

source: filtered mode
it_it: modalità filtrata

source: formatted as HIGH BYTE LOW BYTE
it_it: formattato come HIGH BYTE LOW BYTE

source: higher sensitivity
it_it: maggiore sensibilità

source: indifferent value
it_it: valore indifferente

source: is a function of
it_it: è una funzione di

source: less sensitivity
it_it: minore sensibilità

source: number of StallGuard2 measurements per decrement:
it_it: numero di misurazioni StallGuard2 per decremento:

source: precedes a hexadecimal number, e.g. 0x04
it_it: precede un numero esadecimale, ad esempio 0x04

source: precedes a multi-bit binary number, e.g. %100
it_it: precede un numero binario multi-bit, ad esempio %100

source: read XACTUAL
it_it: legge XACTUAL

source: running two motors at identical speed with a constant micro step difference or by
it_it: facendo funzionare due motori alla stessa velocità con una differenza di micro-passi costante o

source: running two motors at slightly different speeds.
it_it: facendo funzionare due motori a velocità leggermente diverse.

source: standard mode
it_it: modalità standard

source: step width is 1, 2, 4, 8
it_it: la larghezza del passo è 1, 2, 4, 8

source: the SG value needs to be zero by tuning SGT (see 2.1.1.1).
it_it: il valore SG deve essere zero regolando SGT (vedere 2.1.1.1).

source: the StallGuard2 threshold SGT needs to be chosen in a way that one gets a sufficient StallGuard2 value SG in the middle of the full range of SG.
it_it: la soglia SGT di StallGuard2 deve essere scelta in modo da ottenere un valore SG di StallGuard2 sufficiente al centro dell'intero intervallo di SG.

source: threshold is
it_it: la soglia è

source: threshold is SEMIN*32
it_it: la soglia è SEMIN*32

source: • Hardware Handshaking:
it_it: • Handshaking Hardware:

source: • Inter-Packet Delay:
it_it: • Ritardo Inter-Packet:

source: • Multi-Packet Option:
it_it: • Opzione Multi-Packet:

source: • Number of parity bits:
it_it: • Numero di bit di parità:

source: • Parity:
it_it: • Parità:

source: • Software Handshaking:
it_it: • Handshaking Software:

source: • Stop Bits:
it_it: • Bit di Stop:

source:  Back EMF constant of the motor [in unit Volt per rad per second]
it_it:  Costante di forza controelettromotrice del motore [in Volt per rad al secondo]

source:  coil inductance of the motor [in unit Henry]
it_it:  Induttanza della bobina del motore [in Henry]

source:  coil resistance of the motor [in unit Ohm]
it_it:  Resistenza della bobina del motore [in Ohm]

source:  load angle [in unit full step]
it_it:  Angolo di carico [in unità di passo completo]

source:  motor supply voltage [in unit Volt]
it_it:  Tensione di alimentazione del motore [in Volt]

source:  phase current [in unit Ampere]
it_it:  Corrente di fase [in Ampere]

source:  speed [in unit full step per second]
it_it:  Velocità [in unità di passo completo al secondo]
